RohanKoshy/Nuvoton_EchoTrack/en-us--M55M1_Series_BSP_CMSIS_V3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/SpeakingDetector.cpp
/**************************************************************************//**
 * @file     SpeakingDetector.cpp
 * @brief    Self-contained speaking-detection module.
 *           Runs embedded face detection + face landmark models, tracks faces
 *           across frames, and derives speaking state from lip motion.
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2024 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
#include "SpeakingDetector.hpp"

#include "BufAttributes.hpp"
#include "FaceDetectionModel.hpp"
#include "FaceDetectorPostProcessing.hpp"
#include "FaceDetectionResult.hpp"
#include "FaceLandmarkModel.hpp"
#include "FaceLandmarkPostProcessing.hpp"
#include "KeypointResult.hpp"
#include "log_macros.h"
#include "imlib.h"

#undef PI
#include "NuMicro.h"

#include <cmath>
#include <cstddef>
#include <stdio.h>
#include <vector>

/* ------------------------------------------------------------------ */
/*  Internal constants                                                 */
/* ------------------------------------------------------------------ */
#define FACE_DETECTION_ACTIVATION_BUF_SZ  (460000)
#define FACE_LANDMARK_ACTIVATION_BUF_SZ   (460000)

#define DEFAULT_FACE_THRESHOLD            (0.4f)
#define DEFAULT_LANDMARK_THRESHOLD        (0.4f)

#define SPEAKING_DEBUG_OVERLAY               (0)

/* Absolute floors (safety net under the per-face adaptive baselines below). */
#define OPEN_MIN_THRESHOLD                   (0.04f)
#define CLOSE_MIN_THRESHOLD                  (0.025f)
#define MOTION_ENERGY_THRESHOLD_ON           (0.002f)
#define MOTION_ENERGY_THRESHOLD_OFF          (0.001f)
#define MOTION_MIN_FLOOR                     (0.0008f)

#define SPEAKING_SMOOTHING_FRAMES            (2)
#define SPEAKING_RELEASE_FRAMES              (4)
#define SPEAKING_MIN_DURATION_FRAMES         (5)
#define SPEAKING_DETECT_EVERY_N_FRAMES       (1)

/* Display path: light lip smoothing + small bbox EMA to absorb detector jitter. */
#define DISPLAY_LANDMARK_SMOOTHING_ALPHA     (0.85f)
#define BBOX_DISPLAY_SMOOTHING_ALPHA         (0.55f)

#define HEAD_MOVE_THRESHOLD                  (0.10f)
#define HEAD_SIZE_CHANGE_THRESHOLD           (0.12f)
#define MOTION_ENERGY_WINDOW                 (6)

/* Adaptive baseline tunables. */
#define ADAPTIVE_K_ON                        (5.0f)
#define ADAPTIVE_K_OFF                       (2.5f)
#define ADAPTIVE_THRESHOLD_MAX               (0.020f)
#define NOISE_EMA_ALPHA                      (0.08f)
#define K_MOTION                             (3.0f)
#define K_OPEN                               (2.5f)
#define MOTION_FLOOR_EPS                     (0.0008f)
#define OPEN_FLOOR_EPS                       (0.010f)
#define OPEN_CLEARLY_OPEN_K                  (2.0f)

/* Mouth landmark indices.  Width pair stays fixed; open uses three vertical pairs. */
#define MOUTH_WIDTH_LEFT_INDEX               (61)
#define MOUTH_WIDTH_RIGHT_INDEX              (291)
#define MOUTH_OPEN_PAIRS                     (3)

static const int s_mouthOpenUpperIdx[MOUTH_OPEN_PAIRS] = {  13,  81, 311 };
static const int s_mouthOpenLowerIdx[MOUTH_OPEN_PAIRS] = {  14, 178, 402 };

static const int s_lipLandmarkIndices[SPEAKING_MAX_LIP_LANDMARKS] = {
    61, 146, 91, 181, 84, 17, 314, 405, 321, 375, 291, 185,
    40, 39, 37, 0, 267, 269, 270, 409, 78, 308, 87, 14
};

/* ------------------------------------------------------------------ */
/*  Tensor arenas                                                      */
/* ------------------------------------------------------------------ */
ACTIVATION_BUF_ATTRIBUTE
static uint8_t s_arenaFace[FACE_DETECTION_ACTIVATION_BUF_SZ];

ACTIVATION_BUF_ATTRIBUTE
static uint8_t s_arenaLandmark[FACE_LANDMARK_ACTIVATION_BUF_SZ];

namespace {

/*
 * Field layout is intentionally compact: bool flags share one 32-bit bitfield
 * storage unit and the short window counters use uint8_t so this BSS array
 * stays small enough for the DTCM placement used by the linker (s_prevLip is
 * 4 x sizeof(PrevLipState)).  Logic is unchanged; only sizes differ.
 */
struct PrevLipState {
    float lipX[SPEAKING_MAX_LIP_LANDMARKS];
    float lipY[SPEAKING_MAX_LIP_LANDMARKS];
    float prevMouthOpenNorm;
    float mouthOpenWindow[MOTION_ENERGY_WINDOW];
    float motionWindow[MOTION_ENERGY_WINDOW];
    float mouthOpenMean;
    float motionEnergy;
    float noiseMean;
    float noiseDev;
    float openBaseline;
    float openBaselineDev;
    float smoothBoxX0;
    float smoothBoxY0;
    float smoothBoxW;
    float smoothBoxH;
    int x0, y0, w, h;
    uint8_t windowIndex;
    uint8_t windowCount;
    /* All booleans packed into a single 4-byte allocation unit. */
    uint32_t valid              : 1;
    uint32_t prevMouthValid     : 1;
    uint32_t noiseValid         : 1;
    uint32_t openBaselineValid  : 1;
    uint32_t smoothBoxValid     : 1;
};

static arm::app::FaceDetectionModel s_faceModel;
static arm::app::FaceLandmarkModel s_landmarkModel;

static arm::app::FaceDetectorPostProcess *s_postFace = nullptr;
static arm::app::face_detection::PostProcessParams *s_fdParamsPtr = nullptr;
static arm::app::face_landmark::FaceLandmarkPostProcessing *s_postLandmark = nullptr;

static TfLiteTensor *s_faceInput = nullptr;
static TfLiteTensor *s_landmarkInput = nullptr;
static int s_faceCols = 0;
static int s_faceRows = 0;
static int s_landmarkCols = 0;
static int s_landmarkRows = 0;

static std::vector<arm::app::face_detection::DetectionResult> s_faceResults;
static std::vector<arm::app::face_landmark::KeypointResult> s_keypoints;

static PrevLipState s_prevLip[MAX_TRACKED_FACES];
static int s_speakingConfirmCount[MAX_TRACKED_FACES];
static int s_speakingReleaseCount[MAX_TRACKED_FACES];
static int s_speakingDurationCount[MAX_TRACKED_FACES];
static bool s_speaking[MAX_TRACKED_FACES];

static float s_displayRelX[SPEAKING_MAX_LIP_LANDMARKS];
static float s_displayRelY[SPEAKING_MAX_LIP_LANDMARKS];
static uint32_t s_speakingDetectFrameCount = 0;

static float s_faceThreshold = DEFAULT_FACE_THRESHOLD;
static float s_landmarkThreshold = DEFAULT_LANDMARK_THRESHOLD;
static float s_motionEnergyOn = MOTION_ENERGY_THRESHOLD_ON;
static float s_motionEnergyOff = MOTION_ENERGY_THRESHOLD_OFF;
static float s_mouthOpenOn = OPEN_MIN_THRESHOLD;
static float s_mouthOpenOff = CLOSE_MIN_THRESHOLD;
static int s_confirmFrames = SPEAKING_SMOOTHING_FRAMES;
static int s_releaseFrames = SPEAKING_RELEASE_FRAMES;

static void ResetTrackState(int trackId)
{
    if (trackId < 0 || trackId >= MAX_TRACKED_FACES) return;
    s_prevLip[trackId] = PrevLipState{};
}

static void InitTrackingState()
{
    for (int i = 0; i < MAX_TRACKED_FACES; i++) {
        ResetTrackState(i);
        s_speakingConfirmCount[i] = 0;
        s_speakingReleaseCount[i] = 0;
        s_speakingDurationCount[i] = 0;
        s_speaking[i] = false;
    }
    s_speakingDetectFrameCount = 0;
}

static float Distance2D(
    const std::vector<arm::app::face_landmark::KeypointResult> &keypoints,
    int idxA,
    int idxB)
{
    if (idxA >= (int)keypoints.size() || idxB >= (int)keypoints.size()) return 0.0f;

    float dx = (float)(keypoints[idxA].m_x - keypoints[idxB].m_x);
    float dy = (float)(keypoints[idxA].m_y - keypoints[idxB].m_y);
    return std::sqrt(dx * dx + dy * dy);
}

