RohanKoshy/Nuvoton_EchoTrack/en-us--M55M1_Series_BSP_CMSIS_V3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/SpeakingDetector.cpp
static float ComputeMouthOpenNorm(
    const std::vector<arm::app::face_landmark::KeypointResult> &keypoints)
{
    if (keypoints.size() < 468) return 0.0f;

    float openSum = 0.0f;
    for (int i = 0; i < MOUTH_OPEN_PAIRS; i++) {
        openSum += Distance2D(keypoints, s_mouthOpenUpperIdx[i], s_mouthOpenLowerIdx[i]);
    }
    float meanOpen = openSum / (float)MOUTH_OPEN_PAIRS;

    float mouthWidth = Distance2D(keypoints, MOUTH_WIDTH_LEFT_INDEX, MOUTH_WIDTH_RIGHT_INDEX);
    if (mouthWidth < 1.0f) return 0.0f;
    return meanOpen / mouthWidth;
}

static float MeanWindow(const float *values, int count)
{
    if (count <= 0) return 0.0f;

    float sum = 0.0f;
    for (int i = 0; i < count; i++) {
        sum += values[i];
    }
    return sum / (float)count;
}

static void UpdateMotionWindow(
    int trackId,
    float mouthOpenNorm,
    float *outMouthOpenMean,
    float *outMotionEnergy)
{
    PrevLipState *state = &s_prevLip[trackId];
    float velocity = 0.0f;

    if (state->prevMouthValid) {
        velocity = std::fabs(mouthOpenNorm - state->prevMouthOpenNorm);
    }

    state->mouthOpenWindow[state->windowIndex] = mouthOpenNorm;
    state->motionWindow[state->windowIndex] = velocity;
    state->windowIndex = (uint8_t)((state->windowIndex + 1) % MOTION_ENERGY_WINDOW);
    if (state->windowCount < MOTION_ENERGY_WINDOW) {
        state->windowCount = (uint8_t)(state->windowCount + 1);
    }

    state->prevMouthOpenNorm = mouthOpenNorm;
    state->prevMouthValid = 1;

    state->mouthOpenMean = MeanWindow(state->mouthOpenWindow, state->windowCount);
    state->motionEnergy = MeanWindow(state->motionWindow, state->windowCount);

    *outMouthOpenMean = state->mouthOpenMean;
    *outMotionEnergy = state->motionEnergy;
}

static void UpdateNoiseBaseline(int trackId, float motionEnergy)
{
    PrevLipState *state = &s_prevLip[trackId];

    if (!state->noiseValid) {
        state->noiseMean = motionEnergy;
        state->noiseDev = 0.0f;
        state->noiseValid = 1;
        return;
    }

    float diff = std::fabs(motionEnergy - state->noiseMean);
    state->noiseMean = (NOISE_EMA_ALPHA * motionEnergy) +
        ((1.0f - NOISE_EMA_ALPHA) * state->noiseMean);
    state->noiseDev = (NOISE_EMA_ALPHA * diff) +
        ((1.0f - NOISE_EMA_ALPHA) * state->noiseDev);
}

static void UpdateOpenBaseline(int trackId, float mouthOpenMean)
{
    PrevLipState *state = &s_prevLip[trackId];

    if (!state->openBaselineValid) {
        state->openBaseline = mouthOpenMean;
        state->openBaselineDev = 0.0f;
        state->openBaselineValid = 1;
        return;
    }

    float diff = std::fabs(mouthOpenMean - state->openBaseline);
    state->openBaseline = (NOISE_EMA_ALPHA * mouthOpenMean) +
        ((1.0f - NOISE_EMA_ALPHA) * state->openBaseline);
    state->openBaselineDev = (NOISE_EMA_ALPHA * diff) +
        ((1.0f - NOISE_EMA_ALPHA) * state->openBaselineDev);
}

static bool LooksRestLike(int trackId, float mouthOpenMean, int headUnstable)
{
    PrevLipState *state = &s_prevLip[trackId];

    if (headUnstable) return false;
    if (mouthOpenMean >= s_mouthOpenOn) return false;
    if (state->openBaselineValid) {
        float ceiling = state->openBaseline +
            (OPEN_CLEARLY_OPEN_K * (state->openBaselineDev + OPEN_FLOOR_EPS));
        if (mouthOpenMean >= ceiling) return false;
    }
    return true;
}

static float ClampThreshold(float value, float minValue)
{
    if (value < minValue) return minValue;
    if (value > ADAPTIVE_THRESHOLD_MAX) return ADAPTIVE_THRESHOLD_MAX;
    return value;
}

static void GetAdaptiveThresholds(int trackId, float *outOn, float *outOff)
{
    PrevLipState *state = &s_prevLip[trackId];

    float adaptiveOn = s_motionEnergyOn;
    float adaptiveOff = s_motionEnergyOff;
    if (state->noiseValid) {
        adaptiveOn = state->noiseMean + (ADAPTIVE_K_ON * state->noiseDev);
        adaptiveOff = state->noiseMean + (ADAPTIVE_K_OFF * state->noiseDev);
    }

    *outOn = ClampThreshold(adaptiveOn, s_motionEnergyOn);
    *outOff = ClampThreshold(adaptiveOff, s_motionEnergyOff);
}

static void ApplyDisplayLipSmoothing(
    const std::vector<arm::app::face_landmark::KeypointResult> &keypoints,
    int trackId, int faceW, int faceH,
    float *outRelX, float *outRelY)
{
    for (int i = 0; i < SPEAKING_MAX_LIP_LANDMARKS; i++) {
        int idx = s_lipLandmarkIndices[i];
        float rawRelX = 0.0f;
        float rawRelY = 0.0f;

        if (idx < (int)keypoints.size() && faceW > 0 && faceH > 0) {
            rawRelX = (float)keypoints[idx].m_x / (float)faceW;
            rawRelY = (float)keypoints[idx].m_y / (float)faceH;
        }

        if (trackId >= 0 && trackId < MAX_TRACKED_FACES && s_prevLip[trackId].valid) {
            outRelX[i] = DISPLAY_LANDMARK_SMOOTHING_ALPHA * rawRelX +
                (1.0f - DISPLAY_LANDMARK_SMOOTHING_ALPHA) * s_prevLip[trackId].lipX[i];
            outRelY[i] = DISPLAY_LANDMARK_SMOOTHING_ALPHA * rawRelY +
                (1.0f - DISPLAY_LANDMARK_SMOOTHING_ALPHA) * s_prevLip[trackId].lipY[i];
        } else {
            outRelX[i] = rawRelX;
            outRelY[i] = rawRelY;
        }
    }
}

static int FindMatchingPrevFace(int curX0, int curY0, int curW, int curH)
{
    int bestIdx = -1;
    float bestDist = 1e9f;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;

    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_prevLip[j].valid) continue;
        int prevCx = s_prevLip[j].x0 + s_prevLip[j].w / 2;
        int prevCy = s_prevLip[j].y0 + s_prevLip[j].h / 2;
        float dx = (float)(curCx - prevCx);
        float dy = (float)(curCy - prevCy);
        float dist = std::sqrt(dx * dx + dy * dy);
        if (dist < bestDist && dist < (float)(curW + curH)) {
            bestDist = dist;
            bestIdx = j;
        }
    }

    return bestIdx;
}

static int AllocateTrack(int faceIdx)
{
    for (int j = 0; j < MAX_TRACKED_FACES; j++) {
        if (!s_prevLip[j].valid) return j;
    }
    return faceIdx % MAX_TRACKED_FACES;
}

static float HeadMoveAmount(int trackId, int curX0, int curY0, int curW, int curH)
{
    if (trackId < 0 || trackId >= MAX_TRACKED_FACES || !s_prevLip[trackId].valid ||
        curW <= 0 || curH <= 0) {
        return 0.0f;
    }

