RohanKoshy/Nuvoton_EchoTrack/en-us--M55M1_Series_BSP_CMSIS_V3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/SpeakingDetector.cpp
    int prevCx = s_prevLip[trackId].x0 + s_prevLip[trackId].w / 2;
    int prevCy = s_prevLip[trackId].y0 + s_prevLip[trackId].h / 2;
    int curCx = curX0 + curW / 2;
    int curCy = curY0 + curH / 2;
    float dx = (float)(curCx - prevCx) / (float)curW;
    float dy = (float)(curCy - prevCy) / (float)curH;
    return std::sqrt(dx * dx + dy * dy);
}

static int HeadUnstable(int trackId, int curX0, int curY0, int curW, int curH)
{
    if (HeadMoveAmount(trackId, curX0, curY0, curW, curH) > HEAD_MOVE_THRESHOLD) {
        return 1;
    }
    if (trackId < 0 || trackId >= MAX_TRACKED_FACES || !s_prevLip[trackId].valid ||
        curW <= 0 || curH <= 0) {
        return 0;
    }

    int prevW = s_prevLip[trackId].w;
    int prevH = s_prevLip[trackId].h;
    float sizeChangeW = (prevW > 0) ? std::fabs((float)(curW - prevW) / (float)prevW) : 0.0f;
    float sizeChangeH = (prevH > 0) ? std::fabs((float)(curH - prevH) / (float)prevH) : 0.0f;
    return (sizeChangeW > HEAD_SIZE_CHANGE_THRESHOLD ||
            sizeChangeH > HEAD_SIZE_CHANGE_THRESHOLD) ? 1 : 0;
}

static void StoreLipState(
    const float *displayRelX, const float *displayRelY,
    int trackId, int faceX0, int faceY0, int faceW, int faceH)
{
    if (trackId < 0 || trackId >= MAX_TRACKED_FACES) return;

    PrevLipState *state = &s_prevLip[trackId];
    for (int i = 0; i < SPEAKING_MAX_LIP_LANDMARKS; i++) {
        state->lipX[i] = displayRelX[i];
        state->lipY[i] = displayRelY[i];
    }

    state->x0 = faceX0;
    state->y0 = faceY0;
    state->w = faceW;
    state->h = faceH;

    if (state->smoothBoxValid) {
        const float a = BBOX_DISPLAY_SMOOTHING_ALPHA;
        state->smoothBoxX0 = (a * (float)faceX0) + ((1.0f - a) * state->smoothBoxX0);
        state->smoothBoxY0 = (a * (float)faceY0) + ((1.0f - a) * state->smoothBoxY0);
        state->smoothBoxW  = (a * (float)faceW)  + ((1.0f - a) * state->smoothBoxW);
        state->smoothBoxH  = (a * (float)faceH)  + ((1.0f - a) * state->smoothBoxH);
    } else {
        state->smoothBoxX0 = (float)faceX0;
        state->smoothBoxY0 = (float)faceY0;
        state->smoothBoxW  = (float)faceW;
        state->smoothBoxH  = (float)faceH;
        state->smoothBoxValid = 1;
    }
    state->valid = 1;
}

static void GetDisplayBox(int trackId,
    int rawX0, int rawY0, int rawW, int rawH,
    int *outX0, int *outY0, int *outW, int *outH)
{
    if (trackId >= 0 && trackId < MAX_TRACKED_FACES && s_prevLip[trackId].smoothBoxValid) {
        *outX0 = (int)s_prevLip[trackId].smoothBoxX0;
        *outY0 = (int)s_prevLip[trackId].smoothBoxY0;
        *outW  = (int)s_prevLip[trackId].smoothBoxW;
        *outH  = (int)s_prevLip[trackId].smoothBoxH;
    } else {
        *outX0 = rawX0;
        *outY0 = rawY0;
        *outW  = rawW;
        *outH  = rawH;
    }
}

static void FillLipDrawPoints(
    SpeakingFaceResult *result,
    const float *displayRelX,
    const float *displayRelY,
    int boxX0,
    int boxY0,
    int boxW,
    int boxH)
{
    result->lipCount = SPEAKING_MAX_LIP_LANDMARKS;
    for (int i = 0; i < SPEAKING_MAX_LIP_LANDMARKS; i++) {
        result->lipX[i] = boxX0 + (int)(displayRelX[i] * (float)boxW);
        result->lipY[i] = boxY0 + (int)(displayRelY[i] * (float)boxH);
    }
}

static void ExpandFaceBoxes(int frameW, int frameH)
{
    const float scale = 1.4f;

    for (size_t i = 0; i < s_faceResults.size(); i++) {
        arm::app::face_detection::DetectionResult *faceBox = &s_faceResults[i];
        float scaledH = scale * faceBox->m_h;
        float scaledW = scaledH;
        int newW = (int)scaledW;
        int newH = (int)scaledH;
        int newX = faceBox->m_x0 - (int)((scaledW - faceBox->m_w) / 2.0f);
        int newY = faceBox->m_y0 - (int)((scaledH - faceBox->m_h) / 2.0f);

        if (newX < 0) newX = 0;
        if (newY < 0) newY = 0;
        if (newX + newW >= frameW) newW = frameW - newX;
        if (newY + newH >= frameH) newH = frameH - newY;

        faceBox->m_x0 = newX;
        faceBox->m_y0 = newY;
        faceBox->m_w = newW;
        faceBox->m_h = newH;
    }
}

static void PopulateDefaults(SpeakingFaceResult *result, const arm::app::face_detection::DetectionResult &faceBox)
{
    result->x = faceBox.m_x0;
    result->y = faceBox.m_y0;
    result->w = faceBox.m_w;
    result->h = faceBox.m_h;
    result->isSpeaking = false;
    result->rawMouthOpen = false;
    result->lipCount = 0;
    result->mouthOpenNorm = 0.0f;
    result->motionEnergy = 0.0f;
    result->onThreshold = 0.0f;
    result->offThreshold = 0.0f;
    result->headMove = 0.0f;
    result->openBaseline = 0.0f;
    result->openBaselineDev = 0.0f;
}

} /* anonymous namespace */

/* ================================================================== */
/*  PUBLIC API                                                         */
/* ================================================================== */

int SpeakingDetector_Init(const SpeakingDetectorConfig *cfg)
{
    s_faceThreshold = DEFAULT_FACE_THRESHOLD;
    s_landmarkThreshold = DEFAULT_LANDMARK_THRESHOLD;
    s_motionEnergyOn = MOTION_ENERGY_THRESHOLD_ON;
    s_motionEnergyOff = MOTION_ENERGY_THRESHOLD_OFF;
    s_mouthOpenOn = OPEN_MIN_THRESHOLD;
    s_mouthOpenOff = CLOSE_MIN_THRESHOLD;
    s_confirmFrames = SPEAKING_SMOOTHING_FRAMES;
    s_releaseFrames = SPEAKING_RELEASE_FRAMES;

    if (cfg) {
        s_faceThreshold = cfg->faceThreshold;
        s_landmarkThreshold = cfg->landmarkThreshold;
        s_motionEnergyOn = cfg->marVelocityOn;
        s_motionEnergyOff = cfg->marVelocityOff;
        s_mouthOpenOn = cfg->marOn;
        s_mouthOpenOff = cfg->marOff;
        s_confirmFrames = cfg->confirmFrames;
        s_releaseFrames = cfg->releaseFrames;
    }

    if (!s_faceModel.Init(s_arenaFace, sizeof(s_arenaFace),
            (unsigned char *)arm::app::face_detection::GetModelPointer(),
            arm::app::face_detection::GetModelLen())) {
        printf_err("SpeakingDetector: face model init failed\n");
        return -1;
    }
    info("SpeakingDetector: face model OK\n");

