RohanKoshy/Nuvoton_EchoTrack/en-us--M55M1_Series_BSP_CMSIS_V3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/SpeakingDetector.cpp
    if (!s_landmarkModel.Init(s_arenaLandmark, sizeof(s_arenaLandmark),
            (unsigned char *)arm::app::face_landmark::GetModelPointer(),
            arm::app::face_landmark::GetModelLen())) {
        printf_err("SpeakingDetector: face landmark model init failed\n");
        return -2;
    }
    info("SpeakingDetector: face landmark model OK\n");

    TfLiteIntArray *faceShape = s_faceModel.GetInputShape(0);
    s_faceCols = faceShape->data[arm::app::FaceDetectionModel::ms_inputColsIdx];
    s_faceRows = faceShape->data[arm::app::FaceDetectionModel::ms_inputRowsIdx];
    s_faceInput = s_faceModel.GetInputTensor(0);

    TfLiteIntArray *landmarkShape = s_landmarkModel.GetInputShape(0);
    s_landmarkCols = landmarkShape->data[arm::app::FaceLandmarkModel::ms_inputColsIdx];
    s_landmarkRows = landmarkShape->data[arm::app::FaceLandmarkModel::ms_inputRowsIdx];
    s_landmarkInput = s_landmarkModel.GetInputTensor(0);

    if (!s_faceInput || !s_landmarkInput) {
        printf_err("SpeakingDetector: missing input tensor\n");
        return -3;
    }

    TfLiteTensor *fdOut0 = s_faceModel.GetOutputTensor(0);
    TfLiteTensor *fdOut1 = s_faceModel.GetOutputTensor(1);

    static arm::app::face_detection::PostProcessParams s_fdParams;
    s_fdParams.inputImgRows = s_faceRows;
    s_fdParams.inputImgCols = s_faceCols;
    s_fdParams.originalImageRows = 0;
    s_fdParams.originalImageCols = 0;
    s_fdParams.anchor1 = anchor1;
    s_fdParams.anchor2 = anchor2;
    s_fdParams.threshold = s_faceThreshold;
    s_fdParams.nms = 0.45f;
    s_fdParams.numClasses = 1;
    s_fdParams.topN = 0;
    s_fdParamsPtr = &s_fdParams;

    static arm::app::FaceDetectorPostProcess s_fdPP(fdOut0, fdOut1, s_faceResults, s_fdParams);
    s_postFace = &s_fdPP;

    static arm::app::face_landmark::FaceLandmarkPostProcessing s_flPP(DEFAULT_LANDMARK_THRESHOLD);
    s_flPP = arm::app::face_landmark::FaceLandmarkPostProcessing(s_landmarkThreshold);
    s_postLandmark = &s_flPP;

    InitTrackingState();

    info("SpeakingDetector: init complete (face %dx%d, landmark %dx%d)\n",
         s_faceRows, s_faceCols, s_landmarkRows, s_landmarkCols);
    return 0;
}

int SpeakingDetector_RunFrame(
    uint8_t *rgb565Data, int frameW, int frameH,
    SpeakingFaceResult results[], int maxResults)
{
    if (!s_postFace || !s_postLandmark || !results || maxResults <= 0) return 0;

    image_t srcImg;
    srcImg.w = frameW;
    srcImg.h = frameH;
    srcImg.data = rgb565Data;
    srcImg.pixfmt = PIXFORMAT_RGB565;

    rectangle_t roi;

    s_faceResults.clear();
    s_fdParamsPtr->originalImageRows = frameH;
    s_fdParamsPtr->originalImageCols = frameW;

    roi.x = 0;
    roi.y = 0;
    roi.w = frameW;
    roi.h = frameH;

    image_t faceResized;
    faceResized.w = s_faceCols;
    faceResized.h = s_faceRows;
    faceResized.data = (uint8_t *)s_faceInput->data.data;
    faceResized.pixfmt = PIXFORMAT_GRAYSCALE;
    imlib_nvt_scale(&srcImg, &faceResized, &roi);

    {
        uint8_t *u = (uint8_t *)s_faceInput->data.data;
        int8_t *s = (int8_t *)s_faceInput->data.data;
        for (size_t n = 0; n < s_faceInput->bytes; n++) {
            s[n] = (int8_t)((int32_t)u[n] - 128);
        }
    }

    s_faceModel.RunInference();
    s_postFace->RunPostProcess(s_faceResults);
    ExpandFaceBoxes(frameW, frameH);

    int numFaces = (int)s_faceResults.size();
    if (numFaces > maxResults) numFaces = maxResults;
    if (numFaces > MAX_TRACKED_FACES) numFaces = MAX_TRACKED_FACES;

    s_speakingDetectFrameCount++;
    const int runDetectionThisFrame =
        (s_speakingDetectFrameCount % SPEAKING_DETECT_EVERY_N_FRAMES) == 0;

    for (int i = 0; i < numFaces; i++) {
        const arm::app::face_detection::DetectionResult &faceBox = s_faceResults[i];
        PopulateDefaults(&results[i], faceBox);

        int matchedPrev = FindMatchingPrevFace(faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
        if (matchedPrev < 0 && numFaces == 1) {
            matchedPrev = s_prevLip[0].valid ? 0 : -1;
        }

        int trackId = (matchedPrev >= 0) ? matchedPrev : AllocateTrack(i);
        if (matchedPrev < 0 && trackId < MAX_TRACKED_FACES) {
            ResetTrackState(trackId);
            s_speaking[trackId] = false;
            s_speakingConfirmCount[trackId] = 0;
            s_speakingReleaseCount[trackId] = 0;
            s_speakingDurationCount[trackId] = 0;
        }

        roi.x = faceBox.m_x0;
        roi.y = faceBox.m_y0;
        roi.w = faceBox.m_w;
        roi.h = faceBox.m_h;

        if (roi.w <= 0 || roi.h <= 0) {
            continue;
        }

        image_t landmarkResized;
        landmarkResized.w = s_landmarkCols;
        landmarkResized.h = s_landmarkRows;
        landmarkResized.data = (uint8_t *)s_landmarkInput->data.data;
        landmarkResized.pixfmt = PIXFORMAT_RGB888;
        imlib_nvt_scale(&srcImg, &landmarkResized, &roi);

        {
            uint8_t *u = (uint8_t *)s_landmarkInput->data.data;
            int8_t *s = (int8_t *)s_landmarkInput->data.data;
            for (size_t n = 0; n < s_landmarkInput->bytes; n++) {
                s[n] = (int8_t)((int32_t)u[n] - 128);
            }
        }

        s_landmarkModel.RunInference();

        TfLiteTensor *meshTensor = s_landmarkModel.GetOutputTensor(FACE_LANDMARK_MESH_TENSOR_INDEX);
#if defined(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX)
        TfLiteTensor *leftIrisTensor = s_landmarkModel.GetOutputTensor(FACE_LANDMARK_LEFT_IRIS_TENSOR_INDEX);
#else
        TfLiteTensor *leftIrisTensor = nullptr;
#endif
#if defined(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX)
        TfLiteTensor *rightIrisTensor = s_landmarkModel.GetOutputTensor(FACE_LANDMARK_RIGHT_IRIS_TENSOR_INDEX);
#else
        TfLiteTensor *rightIrisTensor = nullptr;
#endif
        TfLiteTensor *presenceTensor = s_landmarkModel.GetOutputTensor(FACE_LANDMARK_FACE_FLAG_TENSOR_INDEX);

        s_postLandmark->RunPostProcessing(
            s_landmarkRows,
            s_landmarkCols,
            (uint32_t)roi.h,
            (uint32_t)roi.w,
            meshTensor,
            leftIrisTensor,
            rightIrisTensor,
            presenceTensor,
            s_keypoints);

