RohanKoshy/Nuvoton_EchoTrack/en-us--M55M1_Series_BSP_CMSIS_V3.01.003/SampleCode/NuEdgeWise/PoseLandmark_YOLOv8n/SpeakingDetector.cpp
        if (trackId < MAX_TRACKED_FACES && s_keypoints.size() >= 468) {
            ApplyDisplayLipSmoothing(s_keypoints, trackId, roi.w, roi.h, s_displayRelX, s_displayRelY);

            if (runDetectionThisFrame) {
                float mouthOpenNorm = ComputeMouthOpenNorm(s_keypoints);
                float mouthOpenMean = 0.0f;
                float motionEnergy = 0.0f;
                float thresholdOn = 0.0f;
                float thresholdOff = 0.0f;
                float headMove = HeadMoveAmount(trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
                int headUnstable = HeadUnstable(trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);

                UpdateMotionWindow(trackId, mouthOpenNorm, &mouthOpenMean, &motionEnergy);

                /*
                 * Update both adaptive baselines only when this face looks rest-like
                 * (not speaking, head stable, mouth quiet relative to its own baseline)
                 * so the baselines do not drift up into actual speech.
                 */
                if (!s_speaking[trackId] && LooksRestLike(trackId, mouthOpenMean, headUnstable)) {
                    UpdateNoiseBaseline(trackId, motionEnergy);
                    UpdateOpenBaseline(trackId, mouthOpenMean);
                }
                GetAdaptiveThresholds(trackId, &thresholdOn, &thresholdOff);

                const PrevLipState *st = &s_prevLip[trackId];
                float motionExcess = motionEnergy - st->noiseMean;
                float openExcess = mouthOpenMean - st->openBaseline;

                int motionElevated = st->noiseValid &&
                    (motionExcess > K_MOTION * (st->noiseDev + MOTION_FLOOR_EPS)) &&
                    (motionEnergy > s_motionEnergyOn);
                int openElevated = st->openBaselineValid &&
                    (openExcess > K_OPEN * (st->openBaselineDev + OPEN_FLOOR_EPS)) &&
                    (mouthOpenMean > s_mouthOpenOn);
                int openClearlyOpen = st->openBaselineValid &&
                    (mouthOpenMean > (st->openBaseline +
                        OPEN_CLEARLY_OPEN_K * (st->openBaselineDev + OPEN_FLOOR_EPS))) &&
                    (motionEnergy > MOTION_MIN_FLOOR);

                int signalAboveOn = !headUnstable && (motionElevated || openClearlyOpen);
                int signalBelowOff = (!motionElevated) && (!openElevated);

                results[i].rawMouthOpen = signalAboveOn ? true : false;
                results[i].mouthOpenNorm = mouthOpenMean;
                results[i].motionEnergy = motionEnergy;
                results[i].onThreshold = thresholdOn;
                results[i].offThreshold = thresholdOff;
                results[i].headMove = headMove;
                results[i].openBaseline = st->openBaseline;
                results[i].openBaselineDev = st->openBaselineDev;

                if (signalAboveOn) {
                    s_speakingConfirmCount[trackId] =
                        (s_speakingConfirmCount[trackId] < s_confirmFrames) ?
                        s_speakingConfirmCount[trackId] + 1 : s_confirmFrames;
                    s_speakingReleaseCount[trackId] = 0;
                    if (s_speakingConfirmCount[trackId] >= s_confirmFrames) {
                        s_speaking[trackId] = true;
                    }
                } else if (s_speaking[trackId]) {
                    s_speakingDurationCount[trackId]++;
                    if (signalBelowOff) {
                        s_speakingReleaseCount[trackId]++;
                        if (s_speakingReleaseCount[trackId] >= s_releaseFrames &&
                            s_speakingDurationCount[trackId] >= SPEAKING_MIN_DURATION_FRAMES) {
                            s_speaking[trackId] = false;
                        }
                    } else {
                        s_speakingReleaseCount[trackId] = 0;
                    }
                    s_speakingConfirmCount[trackId] = 0;
                } else {
                    s_speakingReleaseCount[trackId] = 0;
                    s_speakingConfirmCount[trackId] = 0;
                    s_speakingDurationCount[trackId] = 0;
                }

                if (!s_speaking[trackId]) {
                    s_speakingDurationCount[trackId] = 0;
                }

                StoreLipState(
                    s_displayRelX, s_displayRelY,
                    trackId, faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h);
            }

            results[i].isSpeaking = s_speaking[trackId];

            int dispX0 = faceBox.m_x0;
            int dispY0 = faceBox.m_y0;
            int dispW  = faceBox.m_w;
            int dispH  = faceBox.m_h;
            GetDisplayBox(trackId,
                faceBox.m_x0, faceBox.m_y0, faceBox.m_w, faceBox.m_h,
                &dispX0, &dispY0, &dispW, &dispH);
            results[i].x = dispX0;
            results[i].y = dispY0;
            results[i].w = dispW;
            results[i].h = dispH;

            FillLipDrawPoints(
                &results[i],
                s_displayRelX,
                s_displayRelY,
                dispX0,
                dispY0,
                dispW,
                dispH);
        } else if (trackId < MAX_TRACKED_FACES) {
            s_prevLip[trackId].valid = 0;
            results[i].isSpeaking = s_speaking[trackId];
        }
    }

    return numFaces;
}

void SpeakingDetector_Draw(
    uint8_t *rgb565Data, int frameW, int frameH,
    const SpeakingFaceResult results[], int numResults)
{
    image_t drawImg;
    drawImg.w = frameW;
    drawImg.h = frameH;
    drawImg.data = rgb565Data;
    drawImg.pixfmt = PIXFORMAT_RGB565;

    int green = COLOR_R5_G6_B5_TO_RGB565(0, COLOR_G6_MAX, 0);
    int blue = COLOR_B5_MAX;

    for (int i = 0; i < numResults; i++) {
        bool speaking = results[i].isSpeaking;
        int boxColor = speaking ? green : blue;
        const char *label = speaking ? "Speaking" : "Not Speaking";

        imlib_draw_rectangle(&drawImg,
            results[i].x, results[i].y,
            results[i].w, results[i].h,
            boxColor, 2, false);

        int labelY = (results[i].y - 14 > 0) ? (results[i].y - 14) : results[i].y;
        imlib_draw_string(&drawImg, results[i].x, labelY, label, boxColor,
                          2, 0, 0, false, false, false, false, 0, false, false);

        for (int k = 0; k < results[i].lipCount && k < SPEAKING_MAX_LIP_LANDMARKS; k++) {
            imlib_draw_circle(&drawImg, results[i].lipX[k], results[i].lipY[k],
                              2, green, 1, true);
        }

#if (SPEAKING_DEBUG_OVERLAY)
        {
            char dbg[112];
            snprintf(dbg, sizeof(dbg),
                     "op %.2f me %.3f on %.3f off %.3f hm %.2f bo %.2f bd %.3f",
                     results[i].mouthOpenNorm,
                     results[i].motionEnergy,
                     results[i].onThreshold,
                     results[i].offThreshold,
                     results[i].headMove,
                     results[i].openBaseline,
                     results[i].openBaselineDev);
            imlib_draw_string(&drawImg, results[i].x, results[i].y + results[i].h + 2,
                              dbg, boxColor, 1, 0, 0, false, false, false, false,
                              0, false, false);
        }
#endif
    }
}

void SpeakingDetector_GetTensorArenas(
    void **faceArena, uint32_t *faceArenaSize,
    void **landmarkArena, uint32_t *landmarkArenaSize)
{
    *faceArena = s_arenaFace;
    *faceArenaSize = sizeof(s_arenaFace);
    *landmarkArena = s_arenaLandmark;
    *landmarkArenaSize = sizeof(s_arenaLandmark);
}
